In [1]:
import pandas as pd

In [4]:
bank=pd.read_csv('bank.csv', sep=';')
bank_add=pd.read_csv('bank-additional.csv', sep=';')

In [3]:
bank

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [5]:
bank_add

     age;"job";"marital";"education";"default";"housing";"loan";"contact";"month";"day_of_week";"duration";"campaign";"pdays";"previous";"poutcome";"emp.var.rate";"cons.price.idx";"cons.conf.idx";"euribor3m";"nr.employed";"y"
0     30;"blue-collar";"married";"basic.9y";"no";"ye...
1     39;"services";"single";"high.school";"no";"no"...
2     25;"services";"married";"high.school";"no";"ye...
3     38;"services";"married";"basic.9y";"no";"unkno...
4     47;"admin.";"married";"university.degree";"no"...
...                                                 ...
4114  30;"admin.";"married";"basic.6y";"no";"yes";"y...
4115  39;"admin.";"married";"high.school";"no";"yes"...
4116  27;"student";"single";"high.school";"no";"no";...
4117  58;"admin.";"married";"high.school";"no";"no";...
4118  34;"management";"single";"high.school";"no";"y...

[4119 rows x 1 columns]

단순 합치기

In [6]:
pd.concat([bank,bank_add],axis=0)

,"age;""job"";""marital"";""education"";""default"";""balance"";""housing"";""loan"";""contact"";""day"";""month"";""duration"";""campaign"";""pdays"";""previous"";""poutcome"";""y""","age;""job"";""marital"";""education"";""default"";""housing"";""loan"";""contact"";""month"";""day_of_week"";""duration"";""campaign"";""pdays"";""previous"";""poutcome"";""emp.var.rate"";""cons.price.idx"";""cons.conf.idx"";""euribor3m"";""nr.employed"";""y"""
0,"30;""unemployed"";""married"";""primary"";""no"";1787;...",NaN
1,"33;""services"";""married"";""secondary"";""no"";4789;...",NaN
2,"35;""management"";""single"";""tertiary"";""no"";1350;...",NaN
3,"30;""management"";""married"";""tertiary"";""no"";1476...",NaN
4,"59;""blue-collar"";""married"";""secondary"";""no"";0;...",NaN
...,...,...
4114,NaN,"30;""admin."";""married"";""basic.6y"";""no"";""yes"";""y..."
4115,NaN,"39;""admin."";""married"";""high.school"";""no"";""yes""..."
4116,NaN,"27;""student"";""single"";""high.school"";""no"";""no"";..."
4117,NaN,"58;""admin."";""married"";""high.school"";""no"";""no"";..."
4118,NaN,"34;""management"";""single"";""high.school"";""no"";""y..."

In [7]:
pd.concat([bank,bank_add],axis=1)

,"age;""job"";""marital"";""education"";""default"";""balance"";""housing"";""loan"";""contact"";""day"";""month"";""duration"";""campaign"";""pdays"";""previous"";""poutcome"";""y""","age;""job"";""marital"";""education"";""default"";""housing"";""loan"";""contact"";""month"";""day_of_week"";""duration"";""campaign"";""pdays"";""previous"";""poutcome"";""emp.var.rate"";""cons.price.idx"";""cons.conf.idx"";""euribor3m"";""nr.employed"";""y"""
0,"30;""unemployed"";""married"";""primary"";""no"";1787;...","30;""blue-collar"";""married"";""basic.9y"";""no"";""ye..."
1,"33;""services"";""married"";""secondary"";""no"";4789;...","39;""services"";""single"";""high.school"";""no"";""no""..."
2,"35;""management"";""single"";""tertiary"";""no"";1350;...","25;""services"";""married"";""high.school"";""no"";""ye..."
3,"30;""management"";""married"";""tertiary"";""no"";1476...","38;""services"";""married"";""basic.9y"";""no"";""unkno..."
4,"59;""blue-collar"";""married"";""secondary"";""no"";0;...","47;""admin."";""married"";""university.degree"";""no""..."
...,...,...
4516,"33;""services"";""married"";""secondary"";""no"";-333;...",NaN
4517,"57;""self-employed"";""married"";""tertiary"";""yes"";...",NaN
4518,"57;""technician"";""married"";""secondary"";""no"";295...",NaN
4519,"28;""blue-collar"";""married"";""secondary"";""no"";11...",NaN
4520,"44;""entrepreneur"";""single"";""tertiary"";""no"";113...",NaN

In [8]:
pd.concat([bank,bank_add],axis=0).shape

(8640, 2)

In [9]:
pd.concat([bank,bank_add],axis=1).shape

(4521, 2)

In [11]:
display(bank)

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

공통 컬럼: age, job, marital, education, default, housing, loan, contact, duration, campaign, previous

In [23]:
df1 = bank[['age', 'job', 'marital', 'education', 'contact', 'duration', 'campaign', 'previous']]
df2 = bank_add[['age', 'job', 'marital', 'education', 'duration', 'emp.var.rate', 'cons.price.idx','cons.conf.idx']]

KeyError: "None of [Index(['age', 'job', 'marital', 'education', 'contact', 'duration', 'campaign',\n       'previous'],\n      dtype='object')] are in the [columns]"

merge를 통해 병합

In [24]:
pd.merge(df1,df2, on=['age','job','duration','education','marital'])

NameError: name 'df1' is not defined

inner,outer 사용

In [28]:
pd.merge(df1,df2, on =['age','job','marital','education','duration'])

NameError: name 'df1' is not defined

In [29]:
pd.merge(df1,df2, on =['age','job','marital','education','duration'],how='outer')

NameError: name 'df1' is not defined

left,right 사용

In [25]:
pd.merge(df1,df2, on =['age','job','marital','education','duration'],how='left')

NameError: name 'df1' is not defined

In [27]:
pd.merge(df1,df2, on =['age','job','marital','education','duration'],how='right')

NameError: name 'df1' is not defined